Revit 2015 API
LoadCombination.CombinationState Property
Returns load combination state.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public string CombinationState { get; }
Visual Basic
Public ReadOnly Property CombinationState As String
	Get
Visual C++
public:
property String^ CombinationState {
	String^ get ();
}
Remarks
The state should be "Serviceability" or "Ultimate".
See Also
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace